import { PublicSetting, Layer, LayerType } from "../types";

export const TEST_SELECTED_LAYERS: Layer[] = [
  {
    id: "sf084098as0df98sf0",
    primitives: [
      {
        properties: [
          {
            key: "_height",
            value: 39.536,
          },
          {
            key: "_lod",
            value: 1,
          },
          {
            key: "_x",
            value: 139.75749661,
          },
          {
            key: "_y",
            value: 35.69099441,
          },
          {
            key: "_z",
            value: 58.622,
          },
          {
            key: "_zmax",
            value: 42.4,
          },
          {
            key: "_zmin",
            value: 2.864,
          },
          {
            key: "計測高さ",
            value: 56.8,
          },
          {
            key: "LOD1立ち上げに使用する高さ",
            value: "点群から取得_中央値",
          },
          {
            key: "_gml_id",
            value: "BLD_7066987c-d5c7-4ffe-8803-f78d7d80cc33",
          },
          {
            key: "延べ面積換算係数",
          },
          {
            key: "建物ID",
            value: "13101-bldg-2999",
          },
          {
            key: "建物構造",
          },
          {
            key: "建物利用現況_小分類",
          },
          {
            key: "建物利用現況_図上面積",
            value: 8003.2482,
          },
          {
            key: "建物利用現況_耐火構造種別",
          },
          {
            key: "建物利用現況_地域地区",
            value: "商業地域",
          },
          {
            key: "建物利用現況_中分類",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "高度地区",
          },
          {
            key: "住所",
            value: "日本 東京都千代田区一ツ橋一丁目",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_継続時間",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水ランク",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水深",
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水ランク",
            value: 1,
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水深",
            value: 0.072,
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "地下階数",
          },
          {
            key: "地区計画",
          },
          {
            key: "地上階数",
          },
          {
            key: "土砂災害警戒区域",
          },
          {
            key: "防火及び準防火地域",
            value: "防火地域",
          },
          {
            key: "名称",
            value: "パレスサイドビル内郵便局",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "用途",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水深",
          },
        ],
      },
      {
        properties: [
          {
            key: "_height",
            value: 139.536,
          },
          {
            key: "_lod",
            value: 1,
          },
          {
            key: "_x",
            value: 139.75749661,
          },
          {
            key: "_y",
            value: 35.69099441,
          },
          {
            key: "_z",
            value: 58.622,
          },
          {
            key: "_zmax",
            value: 42.4,
          },
          {
            key: "_zmin",
            value: 2.864,
          },
          {
            key: "計測高さ",
            value: 56.8,
          },
          {
            key: "LOD1立ち上げに使用する高さ",
            value: "点群から取得_中央値",
          },
          {
            key: "_gml_id",
            value: "BLD_7066987c-d5c7-4ffe-8803-f78d7d80cc33",
          },
          {
            key: "延べ面積換算係数",
          },
          {
            key: "建物ID",
            value: "13101-bldg-2999",
          },
          {
            key: "建物構造",
          },
          {
            key: "建物利用現況_小分類",
          },
          {
            key: "建物利用現況_図上面積",
            value: 8003.2482,
          },
          {
            key: "建物利用現況_耐火構造種別",
          },
          {
            key: "建物利用現況_地域地区",
            value: "商業地域",
          },
          {
            key: "建物利用現況_中分類",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "高度地区",
          },
          {
            key: "住所",
            value: "日本 東京都千代田区一ツ橋一丁目",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_継続時間",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水ランク",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水深",
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水ランク",
            value: 1,
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水深",
            value: 0.072,
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "地下階数",
          },
          {
            key: "地区計画",
          },
          {
            key: "地上階数",
          },
          {
            key: "土砂災害警戒区域",
          },
          {
            key: "防火及び準防火地域",
            value: "防火地域",
          },
          {
            key: "名称",
            value: "パレスサイドビル内郵便局",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "用途",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水深",
          },
        ],
      },
    ],
  },
  {
    id: "0934sflku0s9df8ssf",
    primitives: [
      {
        properties: [
          {
            key: "_height",
            value: 61.114000000000004,
          },
          {
            key: "_lod",
            value: 1,
          },
          {
            key: "_x",
            value: 139.76269951,
          },
          {
            key: "_y",
            value: 35.69734667,
          },
          {
            key: "_z",
            value: 73.78,
          },
          {
            key: "_zmax",
            value: 68.331,
          },
          {
            key: "_zmin",
            value: 7.217,
          },
          {
            key: "計測高さ",
            value: 64.4,
          },
          {
            key: "LOD1立ち上げに使用する高さ",
            value: "点群から取得_中央値",
          },
          {
            key: "_gml_id",
            value: "BLD_52ba524e-7d2c-4b69-b33c-ac60a08c3ce3",
          },
          {
            key: "延べ面積換算係数",
          },
          {
            key: "建物ID",
            value: "13101-bldg-7759",
          },
          {
            key: "建物構造",
          },
          {
            key: "建物利用現況_小分類",
          },
          {
            key: "建物利用現況_図上面積",
            value: 2920.86005,
          },
          {
            key: "建物利用現況_耐火構造種別",
          },
          {
            key: "建物利用現況_地域地区",
            value: "商業地域",
          },
          {
            key: "建物利用現況_中分類",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "江東内部河川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "高度地区",
          },
          {
            key: "住所",
            value: "日本 東京都千代田区神田駿河台一丁目",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_継続時間",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水ランク",
          },
          {
            key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水深",
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水ランク",
            value: 1,
          },
          {
            key: "神田川流域浸水予想区域_想定最大規模_浸水深",
            value: 0.024,
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "地下階数",
          },
          {
            key: "地区計画",
            value: "神田駿河台東部地区",
          },
          {
            key: "地上階数",
          },
          {
            key: "土砂災害警戒区域",
          },
          {
            key: "防火及び準防火地域",
            value: "防火地域",
          },
          {
            key: "名称",
            value: "日本大学病院",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_継続時間",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水ランク",
          },
          {
            key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水深",
          },
          {
            key: "用途",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水深",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_継続時間",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水ランク",
          },
          {
            key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水深",
          },
        ],
      },
    ],
  },
];

export const TEST_LAYER_TYPES: LayerType[] = [
  {
    layerId: "sf084098as0df98sf0",
    tilesType: "building",
  },
  {
    layerId: "0934sflku0s9df8ssf",
    tilesType: "bridge",
  },
];

export const TEST_PUBLIC_SETTINGS: PublicSetting[] = [
  {
    type: "building",
    typeTitle: "建物情報",
    properties: [
      {
        key: "_height",
      },
      {
        key: "_lod",
      },
      {
        key: "_x",
      },
      {
        key: "_y",
      },
      {
        key: "_z",
      },
      {
        key: "_zmax",
      },
      {
        key: "_zmin",
      },
      {
        key: "計測高さ",
      },
      {
        key: "LOD1立ち上げに使用する高さ",
      },
      {
        key: "_gml_id",
      },
      {
        key: "延べ面積換算係数",
      },
      {
        key: "建物ID",
      },
      {
        key: "建物構造",
      },
      {
        key: "建物利用現況_小分類",
      },
      {
        key: "建物利用現況_図上面積",
      },
      {
        key: "建物利用現況_耐火構造種別",
      },
      {
        key: "建物利用現況_地域地区",
      },
      {
        key: "建物利用現況_中分類",
      },
      {
        key: "江東内部河川流域浸水予想区域_想定最大規模_浸水ランク",
      },
      {
        key: "江東内部河川流域浸水予想区域_想定最大規模_浸水深",
      },
      {
        key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水ランク",
      },
      {
        key: "荒川水系荒川洪水浸水想定区域_計画規模_浸水深",
      },
      {
        key: "荒川水系荒川洪水浸水想定区域_想定最大規模_継続時間",
      },
      {
        key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水ランク",
      },
      {
        key: "荒川水系荒川洪水浸水想定区域_想定最大規模_浸水深",
      },
      {
        key: "高度地区",
      },
      {
        key: "住所",
      },
      {
        key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_継続時間",
      },
      {
        key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水ランク",
      },
      {
        key: "城南地区河川流域浸水予想区域（改定）_想定最大規模_浸水深",
      },
      {
        key: "神田川流域浸水予想区域_想定最大規模_浸水ランク",
      },
      {
        key: "神田川流域浸水予想区域_想定最大規模_浸水深",
      },
      {
        key: "石神井川及び白子川流域浸水予想区域_想定最大規模_継続時間",
      },
      {
        key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水ランク",
      },
      {
        key: "石神井川及び白子川流域浸水予想区域_想定最大規模_浸水深",
      },
      {
        key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水ランク",
      },
      {
        key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_計画規模_浸水深",
      },
      {
        key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_継続時間",
      },
      {
        key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水ランク",
      },
      {
        key: "多摩水系多摩川、浅川、大栗川洪水浸水想定区域_想定最大規模_浸水深",
      },
      {
        key: "地下階数",
      },
      {
        key: "地区計画",
      },
      {
        key: "地上階数",
      },
      {
        key: "土砂災害警戒区域",
      },
      {
        key: "防火及び準防火地域",
      },
      {
        key: "名称",
      },
      {
        key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_継続時間",
      },
      {
        key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水ランク",
      },
      {
        key: "野川、仙川、入間川、谷沢川及び丸子川流域浸水予想区域_想定最大規模_浸水深",
      },
      {
        key: "用途",
      },
      {
        key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水ランク",
      },
      {
        key: "利根川水系江戸川洪水浸水想定区域_計画規模_浸水深",
      },
      {
        key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_継続時間",
      },
      {
        key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水ランク",
      },
      {
        key: "利根川水系江戸川洪水浸水想定区域_想定最大規模_浸水深",
      },
      {
        key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水ランク",
      },
      {
        key: "利根川水系利根川洪水浸水想定区域_計画規模_浸水深",
      },
      {
        key: "利根川水系利根川洪水浸水想定区域_想定最大規模_継続時間",
      },
      {
        key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水ランク",
      },
      {
        key: "利根川水系利根川洪水浸水想定区域_想定最大規模_浸水深",
      },
    ],
  },
  {
    type: "bridge",
    typeTitle: "ブリッジ情報",
    properties: [],
  },
];
