const TEST_DATASET_INDEX_DATA = {
  title: "建物モデル（千代田区）",
  indexes: [
    {
      field: "名称",
      values: [
        "エヌ・ティ・ティ・コミュニケーションズ株式会社",
        "消費者庁",
        "成田国際空港株式会社(東京事務所)",
        "麹町警察署麹町四丁目交番",
        "海難審判所",
        "私立東洋高等学校",
        "関東公安調査局",
        "東京法務局",
        "東京歯科大学（水道橋校舎本館）",
        "二松學舍大学九段キャンパス",
        "東京交通会館内郵便局",
        "日本大学病院",
        "共立女子大学",
      ],
    },
    {
      field: "用途",
      values: [
        "業務施設",
        "共同住宅",
        "商業施設",
        "文教厚生施設",
        "宿泊施設",
        "官公庁施設",
        "運輸倉庫施設",
        "供給処理施設",
        "店舗等併用住宅",
        "その他",
        "住宅",
      ],
    },
    {
      field: "住所",
      values: [
        "東京都千代田区内幸町一丁目",
        "東京都千代田区外神田一丁目",
        "東京都千代田区麹町三丁目",
        "東京都千代田区岩本町一丁目",
        "東京都千代田区三番町",
        "東京都千代田区麹町四丁目",
      ],
    },
    {
      field: "建物利用現況_中分類",
      values: [
        "事務所建築物",
        "集合住宅",
        "専用商業施設",
        "教育文化施設",
        "宿泊・遊興施設",
        "官公庁施設",
        "スポーツ・興行施設",
        "倉庫運輸関係施設",
        "供給処理施設",
      ],
    },
    {
      field: "建物利用現況_小分類",
      values: [
        "事務所建築物",
        "集合住宅",
        "商業施設",
        "文化施設",
        "宿泊施設",
        "官公庁施設",
        "興行施設",
        "運輸施設等",
        "処理施設",
        "供給施設",
      ],
    },
  ],
};

const TEST_RESULT_DATA = [
  {
    id: "13101-bldg-8546",
  },
  {
    id: "13101-bldg-8547",
  },
  {
    id: "13101-bldg-8548",
  },
  {
    id: "13101-bldg-8549",
  },
  {
    id: "13101-bldg-8550",
  },
  {
    id: "13101-bldg-8551",
  },
  {
    id: "13101-bldg-8552",
  },
  {
    id: "13101-bldg-8553",
  },
  {
    id: "13101-bldg-8554",
  },
  {
    id: "13101-bldg-8555",
  },
  {
    id: "13101-bldg-8556",
  },
  {
    id: "13101-bldg-8557",
  },
];

export { TEST_DATASET_INDEX_DATA, TEST_RESULT_DATA };
